In [3]:
import pandas as pd
import numpy as np

In [4]:
marketing_data = pd.read_csv('marketing_campaign.csv')
marketing_data[['ID' , 'Year_Birth' , 'Education' , 'Marital_Status' , 'Income' , 'Kidhome' , 'Teenhome' , 'Dt_Customer' , 'Recency' , 'NumStorePurchases' , 'NumWebVisitsMonth']]

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,4,7
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,2,5
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,6,5
...,...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,4,5
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,5,7
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,13,6
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,10,3
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,4,7

### Sorting

In [5]:
# SORTING

marketing_data = marketing_data.sort_values('NumStorePurchases' , ascending=False)
marketing_data

,Unnamed: 0,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
2237,2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,...,6,0,1,0,0,0,0,3,11,0
1325,1325,9212,1962,Master,Married,72828.0,0,1,14-02-2013,17,...,7,0,0,0,0,0,0,3,11,0
499,499,466,1944,Graduation,Married,65275.0,0,0,03-04-2013,9,...,2,0,0,0,0,0,0,3,11,0
755,755,3870,1978,2n Cycle,Together,63855.0,0,0,09-02-2013,28,...,4,0,0,0,0,0,0,3,11,0
470,470,2021,1975,Graduation,Married,61456.0,0,1,27-03-2013,47,...,4,0,0,0,0,0,0,3,11,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1653,1653,4931,1977,Graduation,Together,157146.0,0,0,29-04-2013,13,...,1,0,0,0,0,0,0,3,11,0
981,981,3955,1965,Graduation,Divorced,4861.0,0,0,22-06-2014,20,...,14,0,0,0,0,0,0,3,11,0
2132,2132,11181,1949,PhD,Married,156924.0,0,0,29-08-2013,85,...,0,0,0,0,0,0,0,3,11,0
1524,1524,11110,1973,Graduation,Single,3502.0,1,0,13-04-2013,56,...,14,0,0,0,0,0,0,3,11,0
9,9,5899,1950,PhD,Together,5648.0,1,1,13-03-2014,68,...,20,1,0,0,0,0,0,3,11,0

### CUTTING DATA - CUT - bucketing

In [6]:
bucketted_data = pd.cut(marketing_data['NumStorePurchases'] , bins = [0,4,8,13] , labels = ['Low' , 'Moderate' , 'High'])
print(bucketted_data.head())

2237    High
1325    High
499     High
755     High
470     High
Name: NumStorePurchases, dtype: category
Categories (3, object): ['Low' < 'Moderate' < 'High']

### Drop Duplicates

In [17]:
marketing_data2 = marketing_data[['Education' , 'Marital_Status' , 'Kidhome' , 'Teenhome']]
marketing_data2.drop_duplicates()

       Education Marital_Status  Kidhome  Teenhome
2237  Graduation       Divorced        0         0
1325      Master        Married        0         1
499   Graduation        Married        0         0
755     2n Cycle       Together        0         0
470   Graduation        Married        0         1
...          ...            ...      ...       ...
953          PhD         Single        2         0
907   Graduation          Widow        1         0
380          PhD        Married        2         0
980     2n Cycle          Widow        1         1
1806         PhD         Single        0         2

[135 rows x 4 columns]

### DROPPING

In [20]:

marketing_data2 = marketing_data2.drop(labels=[499]) # dropping row 

marketing_data2 = marketing_data2.drop(labels=['Education'],axis=1) # dropping column
print(marketing_data2)

     Marital_Status  Kidhome  Teenhome
2237       Divorced        0         0
1325        Married        0         1
755        Together        0         0
72          Married        0         1
55         Together        0         0
...             ...      ...       ...
1653       Together        0         0
981        Divorced        0         0
2132        Married        0         0
1524         Single        1         0
9          Together        1         1

[2238 rows x 3 columns]

### REPLACING

In [23]:
marketing_data['Teenhome_replaced'] = (
                                         marketing_data['Teenhome'].replace([0,1,2] , ['No Teen' , 'Has 1 Teen' , 'Has 2 Teen'])
                                      )

marketing_data['Teenhome_replaced']

2237       No Teen
1325    Has 1 Teen
499        No Teen
755        No Teen
470     Has 1 Teen
           ...
1653       No Teen
981        No Teen
2132       No Teen
1524       No Teen
9       Has 1 Teen
Name: Teenhome_replaced, Length: 2240, dtype: object